backend/app/controllers/attempts_controller.rb

INSERT INTO "attempts" ("user_id", "quiz_id", "score", "created_at", "updated_at", "answers") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 5], ["quiz_id", 2], ["score", 0], ["created_at", "2025-12-17 12:56:42.400888"], ["updated_at", "2025-12-17 12:56:42.400888"], ["answers", "{\"2\":\"4\"}"]]
---
  def create
    # Calculate score
    score = calculate_score(@quiz, params[:answers])

    @attempt = @quiz.attempts.build(
      user: current_user,
      score: score,
      answers: params[:answers]
    )

    if @attempt.save

SELECT "questions".* FROM "questions" WHERE "questions"."quiz_id" = $1  [["quiz_id", 7]]
---
  def calculate_score(quiz, answers)
    score = 0
    return 0 unless answers

    answers_hash = answers.try(:to_unsafe_h) || answers
    puts "DEBUG: Answers Hash: #{answers_hash.inspect}"

    quiz.questions.each do |question|