backend/app/controllers/questions_controller.rb

INSERT INTO "questions" ("quiz_id", "text", "options", "correct_answer", "created_at", "updated_at", "question_type") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    if @quiz.user != current_user
      return render json: { error: 'Unauthorized' }, status: :forbidden
    end

    @question = @quiz.questions.build(question_params)

    if @question.save